#Generated by Fabric Compiler ( version 2022.2-SP6.4 <build 146967> ) at Fri Mar  7 14:12:09 2025

remove_design -verilog "D:/BaiduNetdiskDownload/fpga-demos/pcie_dma_test/pcie_dma_test/hdl/dram_pcie.v"
add_design "D:/BaiduNetdiskDownload/fpga-demos/pcie_dma_test/pcie_dma_test/hdl/pcie_dma_test.v"
remove_constraint  -logic -fdc "D:/BaiduNetdiskDownload/fpga-demos/pcie_dma_test/pcie_dma_test/constraints/dram_pcie.fdc"
add_constraint "D:/BaiduNetdiskDownload/fpga-demos/pcie_dma_test/pcie_dma_test/constraints/pcie_dma_test.fdc"
remove_fic "D:/BaiduNetdiskDownload/fpga-demos/pcie_dma_test/pcie_dma_test/synthesize/dram_pcie_syn.fic"
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
add_design D:/BaiduNetdiskDownload/fpga-demos/pcie_dma_test/pcie_dma_test/ipcore/pcie_test/pcie_test.idf
remove_design D:/BaiduNetdiskDownload/fpga-demos/pcie_dma_test/pcie_dma_test/ipcore/ip_pcie/ip_pcie.idf
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
remove_constraint  -logic -fdc "D:/BaiduNetdiskDownload/fpga-demos/pcie_dma_test/pcie_dma_test/constraints/pcie_dma_test.fdc"
add_constraint "D:/BaiduNetdiskDownload/fpga-demos/pcie_dma_test/pcie_dma_test/fdc/pcie_dma_test.fdc"
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
add_design "C:/Users/Wzzz2/OneDrive/Desktop/project_test/ipcore/DDR3_50H/DDR3_50H.idf"
add_design "C:/Users/Wzzz2/OneDrive/Desktop/project_test/ipcore/PLL/PLL.idf"
add_design "C:/Users/Wzzz2/OneDrive/Desktop/project_test/ipcore/rd_fram_buf/rd_fram_buf.idf"
add_design "C:/Users/Wzzz2/OneDrive/Desktop/project_test/ipcore/wr_fram_buf/wr_fram_buf.idf"
add_design "C:/Users/Wzzz2/OneDrive/Desktop/project_test/hdl/pcie_dma_cam_top.v"
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_cam_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_cam_top
add_design "C:/Users/Wzzz2/OneDrive/Desktop/project_test/hdl/cmos_8_16bit.v"
add_design "C:/Users/Wzzz2/OneDrive/Desktop/project_test/hdl/fram_buf.v"
add_design "C:/Users/Wzzz2/OneDrive/Desktop/project_test/hdl/iic_dri.v"
add_design "C:/Users/Wzzz2/OneDrive/Desktop/project_test/hdl/power_on_delay.v"
add_design "C:/Users/Wzzz2/OneDrive/Desktop/project_test/hdl/rd_buf.v"
add_design "C:/Users/Wzzz2/OneDrive/Desktop/project_test/hdl/rd_ctrl.v"
add_design "C:/Users/Wzzz2/OneDrive/Desktop/project_test/hdl/reg_config.v"
add_design "C:/Users/Wzzz2/OneDrive/Desktop/project_test/hdl/i2c_com.v"
add_design "C:/Users/Wzzz2/OneDrive/Desktop/project_test/hdl/wr_buf.v"
add_design "C:/Users/Wzzz2/OneDrive/Desktop/project_test/hdl/wr_ctrl.v"
add_design "C:/Users/Wzzz2/OneDrive/Desktop/project_test/hdl/wr_rd_ctrl_top.v"
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_cam_top
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_cam_top
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_cam_top
add_design "C:/Users/Wzzz2/OneDrive/Desktop/project_test/hdl/wr_cmd_trans.v"
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_cam_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
pnr 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
add_design "C:/Users/Wzzz2/OneDrive/Desktop/project_test/hdl/pcie_test_step1.v"
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_cam_top
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_test_step1
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_test_step1
remove_design -force -verilog "C:/Users/Wzzz2/OneDrive/Desktop/project_test/hdl/pcie_test_step1.v"
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_cam_top
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_cam_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module power_on_delay
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_cam_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
remove_design -verilog "C:/Users/Wzzz2/OneDrive/Desktop/project_test/hdl/pcie_dma_cam_top.v"
add_design "C:/Users/Wzzz2/OneDrive/Desktop/project_test/hdl/pcie_dma_ddr3.v"
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
remove_design -verilog "C:/Users/Wzzz2/OneDrive/Desktop/project_test/hdl/pcie_dma_ddr3.v"
add_design "C:/Users/Wzzz2/OneDrive/Desktop/project_test/hdl/pcie_dma_ddr3_cam1.v"
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
remove_design -verilog "C:/Users/Wzzz2/OneDrive/Desktop/project_test/hdl/power_on_delay.v"
add_design "C:/Users/Wzzz2/OneDrive/Desktop/project_test/hdl/power_on_delay_fixed.v"
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
add_design "C:/Users/Wzzz2/OneDrive/Desktop/project_test/hdl/power_on_delay.v"
remove_design -verilog "C:/Users/Wzzz2/OneDrive/Desktop/project_test/hdl/power_on_delay_fixed.v"
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
add_fic "C:/Users/Wzzz2/OneDrive/Desktop/project_test/synthesize/pcie_dma_ddr3_cam1_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_test
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
pnr 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
remove_design -verilog "C:/Users/Wzzz2/OneDrive/Desktop/project_test/hdl/i2c_com.v"
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module pcie_dma_ddr3_cam1
